import os
from yandex_cloud_ml_sdk import YCloudML

from glob import glob
from tqdm.auto import tqdm
import pandas as pd

from yandex_cloud_ml_sdk.search_indexes import (
    StaticIndexChunkingStrategy,
    TextSearchIndexType,
    HybridSearchIndexType,
    ReciprocalRankFusionIndexCombinationStrategy,
)

#Доступ к API и создание модели на предобученой ламе
sdk = YCloudML(folder_id="b1g6rjppcrrhq56lsqr0", auth="AQVNxTuU2_Efl4APdsHSsNBwMzOpuLziy4TeHEr2")


# 0-ая модель
model = (sdk.models.completions("gpt://b1g6rjppcrrhq56lsqr0/yandexgpt-lite/rc@tamrkppb6gudqt87drov0"))
# Tokens: 1262, 4.2028526148969885 chars/tokens
# Пример 1
#
#
# Дата:
# Подразделение: АОР
# Операция: Пахота
# Культура: Свекла сахарная
# За день, га: 61
# С начала операции, га: 793
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Пахота
# Культура: Пшеница озимая семенная
# За день, га: 60
# С начала операции, га: 231
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Дискование
# Культура: Рапс озимый
# За день, га: 32
# С начала операции, га: 484
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Дискование
# Культура: Пшеница озимая семенная
# За день, га: 20
# С начала операции, га: 281
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Дискование
# Культура: Свекла сахарная
# За день, га: 83
# С начала операции, га: 1065
# Вал за день, ц:
# Вал с начала, ц:
#
#
# Пример 2
#
#
# Дата:
# Подразделение: АОР
# Операция: Посев
# Культура: Кукуруза товарная
# За день, га: 24
# С начала операции, га: 252
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Культивация
# Культура: Кукуруза озимая товарная
# За день, га: 94
# С начала операции, га: 490
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Гербицидная обработка
# Культура: Пшеница озимая товарная
# За день, га: 103
# С начала операции, га: 557
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Подкормка
# Культура: Рапс озимый
# За день, га: 152
# С начала операции, га: 152
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Подкормка
# Культура: Ячмень озимый
# За день, га: 97
# С начала операции, га: 97
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Боронование довсходовое
# Культура: Подсолнечник товарный
# За день, га: 524
# С начала операции, га: 524
# Вал за день, ц:
# Вал с начала, ц:
#
#
# Пример 3
#
#
# Дата: 2025-10-23 00:00:00
# Подразделение: АОР
# Операция: Внесение минеральных удобрений
# Культура: Пшеница озимая товарная
# За день, га: 216
# С начала операции, га: 7698
# Вал за день, ц:
# Вал с начала, ц:
#
#
# Пример 4
#
#
# Дата:
# Подразделение: АОР
# Операция: Пахота
# Культура: Соя товарная
# За день, га: 13
# С начала операции, га: 1464
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Дискование
# Культура: Свекла сахарная
# За день, га: 36
# С начала операции, га: 1391
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Дискование 2-е
# Культура: Свекла сахарная
# За день, га: 111
# С начала операции, га: 1288
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Выравнивание зяби
# Культура: Свекла сахарная
# За день, га: 30
# С начала операции, га: 1395
# Вал за день, ц:
# Вал с начала, ц:
#
#
# Пример 5
#
#
# Дата:
# Подразделение: АОР
# Операция: Выравнивание зяби
# Культура: Соя товарная
# За день, га: 187
# С начала операции, га: 740
# Вал за день, ц:
# Вал с начала, ц:
#
#
#
# Пример 6
#
#
# Дата:
# Подразделение: АОР
# Операция: Выравнивание зяби
# Культура: Свекла сахарная
# За день, га: 67
# С начала операции, га: 912
# Вал за день, ц:
# Вал с начала, ц:
#
#
# Пример 7
#
#
# Дата:
# Подразделение: АОР
# Операция: Выравнивание зяби
# Культура: Соя товарная
# За день, га: 187
# С начала операции, га: 740
# Вал за день, ц:
# Вал с начала, ц:
#
#
#
# Process finished with exit code 0

# 1-ая модель
# model = (sdk.models.completions("gpt://b1g6rjppcrrhq56lsqr0/llama-lite/latest@tamrv6si2nqsg5ea5srge"))
# Tokens: 1232, 4.305194805194805 chars/tokens
# Пример 1
#
#
# Дата:
# Подразделение: АОР
# Операция: Пахота
# Культура: Соя товарная
# За день, га: 61
# С начала операции, га: 793
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Дискование
# Культура: Соя товарная
# За день, га: 32
# С начала операции, га: 484
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Дискование
# Культура: Соя товарная
# За день, га: 20
# С начала операции, га: 281
# Вал за день, ц:
# Вал с начала, ц:
#
#
# Пример 2
#
#
# Дата:
# Подразделение: Восход
# Операция: Пахота
# Культура: Кукуруза товарная
# За день, га: 24
# С начала операции, га: 252
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: Восход
# Операция: Внесение минеральных удобрений
# Культура: Кукуруза товарная
# За день, га: 94
# С начала операции, га: 490
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: Восход
# Операция: Боронование довсходовое
# Культура: Подсолнечник товарный
# За день, га: 524
# С начала операции, га: 524
# Вал за день, ц:
# Вал с начала, ц:
#
#
# Пример 3
#
#
# Дата: 2025-10-23 00:00:00
# Подразделение: АОР
# Операция: Внесение минеральных удобрений
# Культура: Пшеница озимая товарная
# За день, га: 216
# С начала операции, га: 7698
# Вал за день, ц:
# Вал с начала, ц:
#
#
# Пример 4
#
#
# Дата:
# Подразделение: АОР
# Операция: Пахота
# Культура: Соя товарная
# За день, га: 13
# С начала операции, га: 1464
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Дискование
# Культура: Свекла сахарная
# За день, га: 36
# С начала операции, га: 1391
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Дискование 2-е
# Культура: Свекла сахарная
# За день, га: 111
# С начала операции, га: 1288
# Вал за день, ц:
# Вал с начала, ц:
#
# Дата:
# Подразделение: АОР
# Операция: Выравнивание зяби
# Культура: Свекла сахарная
# За день, га: 30
# С начала операции, га: 1395
# Вал за день, ц:
# Вал с начала, ц:
#
#
# Пример 5
#
#
# Дата:
# Подразделение: ТСК
# Операция: Выравнивание зяби
# Культура: Соя товарная
# За день, га: 187
# С начала операции, га: 740
# Вал за день, ц:
# Вал с начала, ц:
#
#
# Пример 6
#
#
# Дата:
# Подразделение: АОР
# Операция: Выравнивание зяби
# Культура: Свекла сахарная
# За день, га: 67
# С начала операции, га: 912
# Вал за день, ц:
# Вал с начала, ц:
#
#
# Пример 7
#
#
# Дата:
# Подразделение: ТСК
# Операция: Выравнивание зяби
# Культура: Соя товарная
# За день, га: 187
# С начала операции, га: 740
# Вал за день, ц:
# Вал с начала, ц:
#
#
#
# Process finished with exit code 0

# 2-ая модель
# model = (sdk.models.completions("gpt://b1g6rjppcrrhq56lsqr0/yandexgpt-lite/rc@tamr6446id7s4ou1k7s1p"))
# Tokens: 1262, 4.2028526148969885 chars/tokens
# Пример 1
#
# Дата:     Подразделение: АОР  Операция: Пахота  Культура: Подсолнечник товарный  За день, га: 61  С начала операции, га: 793  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Пахота  Культура: Пшеница озимая товарная  За день, га: 60  С начала операции, га: 231  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Дискование  Культура: Свекла сахарная  За день, га: 32  С начала операции, га: 484  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Дискование  Культура: Рапс озимый  За день, га: 20  С начала операции, га: 281  Вал за день, ц:     Вал с начала, ц:
#
# Пример 2
#
# Дата:     Подразделение: АОР  Операция: Посев  Культура: Кукуруза товарная  За день, га: 24  С начала операции, га: 252  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Предпосевная культивация  Культура: Кукуруза товарная  За день, га: 94  С начала операции, га: 490  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Гербицидная обработка  Культура: Пшеница озимая товарная  За день, га: 103  С начала операции, га: 557  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Подкормка  Культура: Рапс озимый  За день, га: 152  С начала операции, га: 152  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Подкормка  Культура: Овес озимый  За день, га: 97  С начала операции, га: 97  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Боронование довсходовое  Культура: Подсолнечник товарный  За день, га: 524  С начала операции, га: 524  Вал за день, ц:     Вал с начала, ц:
#
# Пример 3
#
# Дата: 2024-10-23 00:00:00     Подразделение: АОР  Операция: Внесение минеральных удобрений  Культура: Пшеница озимая товарная  За день, га: 216  С начала операции, га: 216  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение:     Операция:     Культура:     За день, га:     С начала операции, га:     Вал за день, ц:     Вал с начала, ц:
#
# Пример 4
#
# Дата:     Подразделение: АОР  Операция: Пахота  Культура: Соя товарная  За день, га: 13  С начала операции, га: 1464  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Дискование  Культура: Свекла сахарная  За день, га: 36  С начала операции, га: 1391  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Дискование 2-е  Культура: Свекла сахарная  За день, га: 111  С начала операции, га: 1288  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Выравнивание зяби  Культура: Свекла сахарная  За день, га: 30  С начала операции, га: 1395  Вал за день, ц:     Вал с начала, ц:
#
# Пример 5
#
# Дата:     Подразделение: АОР  Операция: Выравнивание зяби  Культура: Соя товарная  За день, га: 187  С начала операции, га: 740  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение:     Операция:     Культура:     За день, га:     С начала операции, га:     Вал за день, ц:     Вал с начала, ц:
#
# Пример 6
#
# Дата:     Подразделение: АОР  Операция: Выравнивание зяби  Культура: Свекла сахарная  За день, га: 67  С начала операции, га: 912  Вал за день, ц:     Вал с начала, ц:
#
# Пример 7
#
# Дата:     Подразделение: АОР  Операция: Выравнивание зяби  Культура: Соя товарная  За день, га: 187  С начала операции, га: 740  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение:     Операция:     Культура:     За день, га:     С начала операции, га:     Вал за день, ц:     Вал с начала, ц:
#
#
# Process finished with exit code 0


# 3-ая модель
# model = (sdk.models.completions("gpt://b1g6rjppcrrhq56lsqr0/llama-lite/latest@tamrd5l9skmd4vo9c25bl"))
# МЕГА ХУЙНЯ


#4-ая модель
# model = (sdk.models.completions("gpt://b1g6rjppcrrhq56lsqr0/yandexgpt-lite/latest@tamrqjn581lvep32v2qeg"))
# Tokens: 1262, 4.2028526148969885 chars/tokens
# Пример 1
#
# Дата:     Подразделение: АОР  Операция: Пахота  Культура: Сорго кормовое  За день, га: 61  С начала операции, га: 793  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Пахота  Культура: Горох товарный  За день, га: 60  С начала операции, га: 231  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Дискование  Культура: Кукуруза товарная  За день, га: 32  С начала операции, га: 484  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Дискование  Культура: Пшеница озимая товарная  За день, га: 20  С начала операции, га: 281  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Дискование  Культура: Свекла сахарная  За день, га: 83  С начала операции, га: 203  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Дискование  Культура: Сорго  За день, га: 61  С начала операции, га: 793  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение:     Операция:     Культура:     За день, га:     С начала операции, га:     Вал за день, ц:     Вал с начала, ц:
#
# Пример 2
#
# Дата:     Подразделение: АОР  Операция: Сев  Культура: Кукуруза товарная  За день, га: 24  С начала операции, га: 252  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Предпосевная культивация  Культура: Кукуруза товарная  За день, га: 94  С начала операции, га: 490  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Пахота  Культура: Пшеница озимая товарная  За день, га: 103  С начала операции, га: 557  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Подкормка  Культура: Рапс озимый  За день, га: 152  С начала операции, га: 152  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Боронование довсходовое  Культура: Подсолнечник товарный  За день, га: 524  С начала операции, га: 524  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение:     Операция:     Культура:     За день, га:     С начала операции, га:     Вал за день, ц:     Вал с начала, ц:
#
# Пример 3
#
# Дата:     Подразделение: АОР  Операция: Внесение минеральных удобрений  Культура: Пшеница озимая товарная  За день, га: 216  С начала операции, га: 7698  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Пахота  Культура: Подсолнечник товарный  За день, га: 2025  С начала операции, га: 7698  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение:     Операция:     Культура:     За день, га:     С начала операции, га:     Вал за день, ц:     Вал с начала, ц:
#
# Пример 4
#
# Дата:     Подразделение: АОР  Операция: Пахота  Культура: Соя товарная  За день, га: 13  С начала операции, га: 1464  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Дискование  Культура: Свекла сахарная  За день, га: 36  С начала операции, га: 1391  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Дискование 2-е  Культура: Свекла сахарная  За день, га: 111  С начала операции, га: 1288  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция: Выравнивание зяби  Культура: Свекла сахарная  За день, га: 30  С начала операции, га: 1395  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение:     Операция:     Культура:     За день, га:     С начала операции, га:     Вал за день, ц:     Вал с начала, ц:
#
# Пример 5
#
# Дата:     Подразделение: ТСК  Операция: Выравнивание зяби  Культура: Соя товарная  За день, га: 187  С начала операции, га: 740  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение:     Операция:     Культура:     За день, га:     С начала операции, га:     Вал за день, ц:     Вал с начала, ц:
#
# Пример 6
#
# Дата:     Подразделение: АОР  Операция: Выравнивание зяби  Культура: Свекла сахарная  За день, га: 67  С начала операции, га: 912  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение: АОР  Операция:     Культура: Сорго  За день, га:     С начала операции, га:     Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение:     Операция:     Культура:     За день, га:     С начала операции, га:     Вал за день, ц:     Вал с начала, ц:
#
# Пример 7
#
# Дата:     Подразделение: ТСК  Операция: Выравнивание зяби  Культура: Соя товарная  За день, га: 187  С начала операции, га: 740  Вал за день, ц:     Вал с начала, ц:
# Дата:     Подразделение:     Операция:     Культура:     За день, га:     С начала операции, га:     Вал за день, ц:     Вал с начала, ц:
#
#
# Process finished with exit code 0


#5-ая модель
# model = (sdk.models.completions("gpt://b1g6rjppcrrhq56lsqr0/yandexgpt-lite/rc@tamrur7jqgegos3foh0dd"))
# МЕГА ХУЙНЯ


#стандартная модель
# model = (sdk.models.completions("yandexgpt"))
# Tokens: 1262, 4.2028526148969885 chars/tokens
# Пример 1
#
# | Группа | Информация |
# |:---|:---|
# | Подразделение | Отд7, Отд20, Отд 3, Отд10 |
# | Операция | Пахота, дискование |
# | Культура | Свекла, подсолнечник, озимые зерновые |
# | За день га | — |
# | С начала операции га | 1065 |
# | Вал за день ц | — |
# | Вал с начала ц | — |
# Пример 2
#
# |Группа|Информация|
# |-------|-------|
# |Подразделение|—|
# |Операция|Посев, предпосевная культивация, подкормка, довсходовое боронование|
# |Культура|Кукуруза, сахарная свёкла, пшеница озимая, рапс озимый, подсолнечник|
# |За день га|252; 94; 103; 152; 97; 524|
# |С начала операции га|—|
# |Вал за день ц|—|
# |Вал с начала ц|—|
# Пример 3
#
# |Группа|Информация|
# |-------|-------|
# |Дата|23.10|
# |Подразделение|Отд 17|
# |Операция|Внесение минеральных удобрений|
# |Культура|Озимая пшеница|
# |За день га|—|
# |С начала операции га| —|
# |Вал за день ц| —|
# |Вал с начала ц| —|
# Пример 4
#
# |Группа|Информация|
# |-------|-------|
# |Подразделение|Отд 17, Отд 16, Отд 11|
# |Операция|Пахота зяби, дискование, выравнивание зяби|
# |Культура|Соя, сахарная свёкла, пшеница|
# |За день га|1464; 36; 1391; 1288; 1395; 491|
# |С начала операции га| —|
# |Вал за день ц| —|
# |Вал с начала ц| —|
# Пример 5
#
# |Группа|Информация|
# |-------|-------|
# |Подразделение| — |
# |Операция|Выравнивание зяби|
# |Культура|Соя|
# |За день га|187|
# |С начала операции га| 740|
# |Вал за день ц| —|
# |Вал с начала ц|—|
# Пример 6
#
# |Группа|Информация|
# |-------|-------|
# |Подразделение|Отд 12|
# |Операция|Выравнивание зяби|
# |Культура|Сахарная свёкла|
# |За день га|912|
# |С начала операции га| —|
# |Вал за день ц| —|
# |Вал с начала ц|—|
# Пример 7
#
# |Группа|Информация|
# |-------|-------|
# |Подразделение| — |
# |Операция|Выравнивание зяби|
# |Культура|Соя|
# |За день га|187|
# |С начала операции га| 740|
# |Вал за день ц| —|
# |Вал с начала ц|—|
#
# Process finished with exit code 0




model = model.configure(temperature=0.5, max_tokens=3000)

message_1 = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: Север \nОтд7 пах с св 41/501\nОтд20 20/281 по пу 61/793\nОтд 3 пах подс.60/231\nПо пу 231\n\nДиск к. Сил отд 7. 32/352\nПу- 484\nДиск под Оз п езубов 20/281\nДиск под с. Св отд 10 83/203 пу-1065га"
message_2 = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: Восход\nПосев кук-24/252га\n24%\nПредпосевная культ\nПод кук-94/490га46%\nСЗРоз пш-103/557га\n25%\nПодкормка оз рапс-\n152га , 100%, подкормка овса-97га, 50%\nДовсходовое боронование подсолнечника-524\nга, 100%."
message_3 = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: 23.10\nВнесение мин удобрений под оз пшеницу 2025 г ПУ Юг 216/7698\nОтд 17-216/1877"

#Пропускает 1 подкормку
message_4 = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: Пахота зяби под сою \nПо Пу 13/1464\nОтд 17 13/203\n\nДисков сах св\nПо Пу 36/1391\nОтд 16 25/25\nОтд 17 11/664\n\n2-е диск сах св под пш\nПо Пу 111/1288\nОтд 17 111/596\n\nВыравн зяби под сах св\nПо Пу 30/1395\nОтд 11 30/491"

#не распознает выравнивание зяби
message_5 = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: ТСК \n Вырав-ие зяби под сою 187 га/ с нарастающим 740 га (13%) Остаток 5357 га\nОсадки 1 мм"

##не видит выравнивание зяби - пишет пахота
message_6 = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \n Вырав-ие зяби под сах/свёклу По ПУ 67/912 Отд 12 67/376"

##не видит выравнивание зяби - пишет пахота
message_7 = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: ТСК \n Выравниваниеие зяби под сою 187 га/ с нарастающим 740 га (13%) Остаток 5357 га\nОсадки 1 мм"
#message_8
#
# # Получение учетных данных из переменных окружения
# #folder_id = os.environ["folder_id"]
# #api_key = os.environ["api_key"]
# # Инициализация SDK Яндекс.Облака
# #sdk = YCloudML(folder_id=folder_id, auth=api_key)
#
# sdk = YCloudML(folder_id="b1g6rjppcrrhq56lsqr0", auth="AQVNxTuU2_Efl4APdsHSsNBwMzOpuLziy4TeHEr2")
#
# #model = sdk.models.completions('yandexgpt')
# ###
# #яндекс 5 лайт рс
# #model = (sdk.models.completions("gpt://b1g6rjppcrrhq56lsqr0/yandexgpt-lite/rc@tamrur7jqgegos3foh0dd"))
#
# #LLama
# model = (sdk.models.completions("gpt://b1g6rjppcrrhq56lsqr0/llama-lite/latest@tamrv6si2nqsg5ea5srge"))
# model = model.configure(temperature=0.5, max_tokens=3000)
#
# def create_thread():
#     return sdk.threads.create(ttl_days=1, expiration_policy="static")
#
# def create_assistant(model, tools=None):
#     kwargs = {}
#     if tools and len(tools) > 0:
#         kwargs = {"tools": tools}
#     return sdk.assistants.create(
#         model, ttl_days=1, expiration_policy="since_last_active", **kwargs
#     )
#
# # Создаем простого ассистента и беседу:
# # thread = create_thread()
# # assistant = create_assistant(model)
#
#
# def get_token_count(filename):
#     with open(filename, "r", encoding="utf8") as f:
#         return len(model.tokenize(f.read()))
#
#
# def get_file_len(filename):
#     with open(filename, encoding="utf-8") as f:
#         return len(f.read())
#
#
# # Основной скрипт
# if __name__ == "__main__":
#
#     thread = create_thread()
#     assistant = create_assistant(model)
#
#     assistant.update(
#         instruction="""Ты — помощник агронома, который должен распределить информацию из собщения по группам: Дата, Подразделение, Операция, Культура, За день га, С начала операции га,Вал за день ц, Вал с начала ц"""
#     )
#
#     print("\nПробная попытка ассистента...")
#     # Пример взаимодействия
#     thread = create_thread()
#     messages = [message_1, message_2, message_3, message_4, message_5, message_6, message_7]
#     for i in range(len(messages)):
#        print(f'Пример {(i + 1)}\n')
#        thread.write(messages[i])
#        response = assistant.run(thread).wait()
#        print(response.text)
#
#     #thread.write(message_1)
#     #response = assistant.run(thread).wait()
#     #print(response.text)
#
#     # messages = [
#     #     {"role": "system",
#     #      "text": "Ты — помощник агронома, который должен распределить информацию из собщения по группам: Дата, Подразделение, Операция, Культура, За день га, С начала операции га,Вал за день ц, Вал с начала ц"},
#     #     {"role": "user", "text": message_1},
#     #     {"role": "user", "text": "посему ты так думаешь?"}
#     # ]
#     #
#     # print("\nПробная попытка чистой модели...")
#     # result = model.run(messages)
#     #
#     # print(result.text)
#
#     thread.delete()
#     assistant.delete()

def get_token_count(filename):
    with open(filename, "r", encoding="utf8") as f:
        return len(model.tokenize(f.read()))


def get_file_len(filename):
    with open(filename, encoding="utf-8") as f:
        return len(f.read())

def upload_file(filename):
    return sdk.files.upload(filename, ttl_days=1, expiration_policy="static")

def create_thread():
    return sdk.threads.create(ttl_days=1, expiration_policy="static")

def create_assistant(model, tools=None):
    kwargs = {}
    if tools and len(tools) > 0:
        kwargs = {"tools": tools}
    return sdk.assistants.create(
        model, ttl_days=1, expiration_policy="since_last_active", **kwargs
    )

with open("data/table.md", encoding="utf-8") as f:
    table = f.readlines()
fw = "".join(table)

tokens = len(model.tokenize(fw))
print(f"Tokens: {tokens}, {len(fw)/tokens} chars/tokens")

header = table[:2]

chunck_size = 600 * 4

s = header.copy()
uploaded_table = []
for x in table[2:]:
    s.append(x)
    if len("".join(s)) > chunck_size:
        id = sdk.files.upload_bytes(
            "".join(s).encode(), ttl_days=5, expiration_policy="static",
            mime_type="text/markdown",
        )

        uploaded_table.append(id)
        s = header.copy()



op = sdk.search_indexes.create_deferred(
    uploaded_table,
    index_type=HybridSearchIndexType(
        combination_strategy=ReciprocalRankFusionIndexCombinationStrategy(),
    ),
)

index = op.wait()

# d = [
#     {
#         "File" : fn,
#         "Tokens" : get_token_count(fn),
#         "Chars" : get_file_len(fn),
#         # "Category" : fn.split("/")[1],
#     }
#     for fn in glob('data/*.md')
#     #if fn.count("/") == 2
# ]
#
# df = pd.DataFrame(d)
# print(df.head())

# df["Uploaded"] = df["File"].apply(upload_file)

# print(df.head())

# op = sdk.search_indexes.create_deferred(
#     df["Uploaded"],
#     index_type=HybridSearchIndexType(
#         # chuncking_strategy=StaticIndexChunkingStrategy(
#         #     max_chunk_size_tokens=1000, chunk_overlap_tokens=100
#         # ),
#         combination_strategy=ReciprocalRankFusionIndexCombinationStrategy(),
#     ),
# )

# operation = sdk.search_indexes.create_deferred(
#         df["Uploaded"],
#         index_type=HybridSearchIndexType(
#         ),
#     )

# index = op.wait()
# index = operation.wait()

# op = index.add_files_deferred( df["Uploaded"])
# xfiles = op.wait()

search_tool = sdk.tools.search_index(index)

assistant = create_assistant(model, tools=[search_tool])
thread = create_thread()

instruction = "Ты — помощник агронома, который должен распределить информацию из собщения по группам: Дата, Подразделение, Операция, Культура, За день га, С начала операции га,Вал за день ц, Вал с начала ц"

_ = assistant.update(instruction=instruction)

# thread.write(message_3)
# run = assistant.run(thread)

messages = [message_1, message_2, message_3, message_4, message_5, message_6, message_7]
for i in range(len(messages)):
    print(f'Пример {(i + 1)}\n')
    thread.write(messages[i])
    response = assistant.run(thread).wait()
    print(response.text)

thread.delete()
assistant.delete()
# result = run.wait()
# print(result.text)


