from colorama import AnsiToWin32
from openpyxl import Workbook
from openpyxl import load_workbook
import json

def empty(curr_sheet, curr_row):
    for i in range(0, 1):
        for j in range(1, 10):
            if curr_sheet.cell(row=curr_row+i, column=j).value != None:
                return False

    return True

wb = load_workbook('data/Исправленные_записи_+добавленные.xlsx')

curr_sheet = wb['Лист1']

i = 3
data = []
txt_user = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: "
txt_system = "Ты — помощник агронома, который должен распределить информацию из собщения по группам: Дата, Подразделение, Операция, Культура, За день га, С начала операции га,Вал за день ц, Вал с начала ц\nЕсли сообщение не похоже на отчетность то так напиши об этом"
#txt_system = "Ты — помощник агронома, который должен распределить информацию из собщения по группам: Дата, Подразделение, Операция, Культура, За день га, С начала операции га,Вал за день ц, Вал с начала ц\nЕсли сообщение не похоже на отчетность то так напиши об этом"
#txt_system = "Ты — помощник агронома, который должен распределить информацию из собщения по группам: Дата, Подразделение, Операция, Культура, За день га, С начала операции га,Вал за день ц, Вал с начала ц\nДата должна быть формата год-месяц-день\nЕсли дата не представлена, то необходимо вставить текущую.\nКультуру необходимо выбирать из данных пердставленных ниже:\nВика+Тритикале\nГорох на зерно\nГорох товарный\nГуар\nКонопля\nКориандр\nКукуруза кормовая\nКукуруза семенная\nКукуруза товарная\nЛюцерна\nМноголетние злаковые травы\nМноголетние травы прошлых лет\nМноголетние травы текущего года\nОвес\nПодсолнечник кондитерский\nПодсолнечник семенной\nПодсолнечник товарный\nПросо\nПшеница озимая на зеленый корм\nПшеница озимая семенная\nПшеница озимая товарная\nРапс озимый\nРапс яровой\nСвекла сахарная\nСорго\nСорго кормовой\nСорго-суданковый гибрид\nСоя семенная\nСоя товарная\nЧистый пар\nЧумиза\nЯчмень озимый\nЯчмень озимый семенной\nОперацию необходимо выбирать из данных пердставленных ниже:\n1-я междурядная культивация\n2-я междурядная культивация\nБоронование довсходовое\nВнесение минеральных удобрений\nВыравнивание зяби\n2-е Выравнивание зяби\nГербицидная обработка\n1 Гербицидная обработка\n2 Гербицидная обработка\n3 Гербицидная обработка\n4 Гербицидная обработка\nДискование\nДискование 2-е\nДискование 3-е\nИнсектицидная обработка\nКультивация\nПахота\nПодкормка\nПредпосевная культивация\nПрикатывание посевов\nСев\nСплошная культивация\nУборка\nФункицидная обработка\nЧизлевание\nПодразделение выбирая исходя из следующей информации (формат: Подразделение Регион Отделение):\nАОР	Кавказ	18\nАОР	Кавказ	19\nАОР	Север	3\nАОР	Север	7\nАОР	Север	10\nАОР	Север	20\nАОР	Центр	1\nАОР	Центр	4\nАОР	Центр	5\nАОР	Центр	6\nАОР	Центр	9\nАОР	Юг	11\nАОР	Юг	12\nАОР	Юг	16\nАОР	Юг	17\nТСК	Нет ПУ	Нет отделения\nАО Кропоткинское	Нет ПУ	Нет отделения\nВосход	Нет ПУ	Нет отделения\nКолхоз Прогресс	Нет ПУ	Нет отделения\nМир	Нет ПУ	Нет отделения\nСП Коломейцево	Нет ПУ	Нет отделения"
txt_answer = "\n"
col_names = ['Дата', 'Подразделение', 'Операция', 'Культура', 'За день, га', 'С начала операции, га', 'Вал за день, ц', 'Вал с начала, ц']

while not(empty(curr_sheet, i)):
    if curr_sheet.cell(row=i, column=1).value != None:
        req = {'request': [{"role": "system", "text": txt_system},
                               {"role": "user", "text": txt_user}],
                   "response": txt_answer
        }

        txt_user = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: "
        txt_answer = "\n"
        message = curr_sheet.cell(row=i, column=1).value
        txt_user += message

        data.append(req)
        i += 1
        continue
        # if curr_sheet.cell(row=i, column=1).value[0:6] == "Пример":
        #     i += 1
        #
        #
        #     req = {'request': [{"role": "system", "text": txt_system},
        #                        {"role": "user", "text": txt_user}],
        #            "response": txt_answer
        #            }
        #
        #     txt_user = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: "
        #     txt_answer = "\n"
        #
        #     data.append(req)
        #
        #     continue
        # else:
        #     message = curr_sheet.cell(row=i, column=1).value
        #     txt_user += message
        #     i += 2
        #
        #     continue




    answer = ''
    for j in range(2, 10):
        if curr_sheet.cell(row=i, column=j).value == None:
            text = "  "
        else:
            text = str(curr_sheet.cell(row=i, column=j).value)

        answer += col_names[j - 2] + ": " + text + '\n'

    #tmp = "Дата:    Подразделение:    Операция:    Культура:    За день, га:    С начала операции, га:    Вал за день, ц:    Вал с начала, ц:    "
    tmp = "Дата:   \nПодразделение:   \nОперация:   \nКультура:   \nЗа день, га:   \nС начала операции, га:   \nВал за день, ц:   \nВал с начала, ц:   \n"
    # print(tmp)
    # print(answer)
    if answer != tmp:
        txt_answer += answer + '\n'
        #print(tmp, answer)

        # print(answer)
        # print(tmp)

    i += 1

data = data[1:]

with open("./data/output1.jsonl", "w", encoding="utf-8") as f:
    for item in data:
        f.write(json.dumps(item, ensure_ascii=False) + "\n")