from yandex_cloud_ml_sdk import YCloudML

sdk = YCloudML(folder_id="b1g6rjppcrrhq56lsqr0", auth="AQVNxTuU2_Efl4APdsHSsNBwMzOpuLziy4TeHEr2")

#model = sdk.models.completions('yandexgpt')
###
#яндекс 5 лайт рс
#model = (sdk.models.completions("gpt://b1g6rjppcrrhq56lsqr0/yandexgpt-lite/rc@tamrur7jqgegos3foh0dd"))

#яндекс лайт 4 лейт
#model = (sdk.models.completions("gpt://b1g6rjppcrrhq56lsqr0/yandexgpt-lite/latest@tamrqjn581lvep32v2qeg"))

#LLama
model = (sdk.models.completions("gpt://b1g6rjppcrrhq56lsqr0/llama-lite/latest@tamrv6si2nqsg5ea5srge"))

model = model.configure(temperature=0.5, max_tokens=2000)

message_1 = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: Север \nОтд7 пах с св 41/501\nОтд20 20/281 по пу 61/793\nОтд 3 пах подс.60/231\nПо пу 231\n\nДиск к. Сил отд 7. 32/352\nПу- 484\nДиск под Оз п езубов 20/281\nДиск под с. Св отд 10 83/203 пу-1065га"
message_2 = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: Восход\nПосев кук-24/252га\n24%\nПредпосевная культ\nПод кук-94/490га46%\nСЗРоз пш-103/557га\n25%\nПодкормка оз рапс-\n152га , 100%, подкормка овса-97га, 50%\nДовсходовое боронование подсолнечника-524\nга, 100%."
message_3 = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: 23.10\nВнесение мин удобрений под оз пшеницу 2025 г ПУ Юг 216/7698\nОтд 17-216/1877"
message_4 = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: Пахота зяби под сою \nПо Пу 13/1464\nОтд 17 13/203\n\nДисков сах св\nПо Пу 36/1391\nОтд 16 25/25\nОтд 17 11/664\n\n2-е диск сах св под пш\nПо Пу 111/1288\nОтд 17 111/596\n\nВыравн зяби под сах св\nПо Пу 30/1395\nОтд 11 30/491"

#не распознает выравнивание зяби
message_5 = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: ТСК \n Вырав-ие зяби под сою 187 га/ с нарастающим 740 га (13%) Остаток 5357 га\nОсадки 1 мм"

##не видит выравнивание зяби - пишет пахота
message_6 = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \n Вырав-ие зяби под сах/свёклу По ПУ 67/912 Отд 12 67/376"

##база
message_7 = "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: ТСК \n Вырав-ие зяби под сою 187 га/ с нарастающим 740 га (13%) Остаток 5357 га\nОсадки 1 мм"
#message_8

messages = [
    {"role": "system", "text": "Ты — помощник агронома, который должен распределить информацию из собщения по группам: Дата, Подразделение, Операция, Культура, За день га, С начала операции га,Вал за день ц, Вал с начала ц"},
    {"role": "user", "text": message_7},
    {"role": "user", "text": "посему ты так думаешь?"}
]

result = model.run(messages)

messages = \
    [
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: Север \nОтд7 пах с св 41/501\nОтд20 20/281 по пу 61/793\nОтд 3 пах подс.60/231\nПо пу 231\n\nДиск к. Сил отд 7. 32/352\nПу- 484\nДиск под Оз п езубов 20/281\nДиск под с. Св отд 10 83/203 пу-1065га",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: Восход\nПосев кук-24/252га\n24%\nПредпосевная культ\nПод кук-94/490га46%\nСЗРоз пш-103/557га\n 25% \n  Подкормка оз рапс- \n152га , 100%, подкормка овса-97га, 50%\nДовсходовое боронование подсолнечника-524\nга, 100%.",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: 23.10\nВнесение мин удобрений под оз пшеницу 2025 г ПУ Юг 216/7698\nОтд 17-216/1877",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: Пахота зяби под сою \nПо Пу 13/1464\nОтд 17 13/203\n\nДисков сах св\nПо Пу 36/1391\nОтд 16 25/25\nОтд 17 11/664\n\n2-е диск сах св под пш\nПо Пу 111/1288\nОтд 17 111/596\n\nВыравн зяби под сах св\nПо Пу 30/1395\nОтд 11 30/491",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: ТСК \n Вырав-ие зяби под сою 187 га/ с нарастающим 740 га (13%) Остаток 5357 га\nОсадки 1 мм",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \n Вырав-ие зяби под сах/свёклу По ПУ 67/912 Отд 12 67/376",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: ТСК \n Выравниваниеие зяби под сою 187 га/ с нарастающим 740 га (13%) Остаток 5357 га\nОсадки 1 мм"
    ]


test_data =\
    [
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"23.10\nВнесение противозлакового гербецида на оз рапсе ПУ Юг 134/578\nОтд 11-134/253\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"Пахота зяби под сою\nПо Пу 13/1440\nОтд 17 13/179\n\nПахота зяби под кук с\nПо Пу 26/471\nОтд 11 26/206\n\nДисков сах св\nПо Пу 85/1237\nОтд 17 85/535\n\nВыравн зяби под сах св\nПо Пу 45/1314\nОтд 11 10/410\nОтд 12 35/661\n\nВыравн зяби под подс\nОтд 11 41/41\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"Пахота зяби под сою\nПо Пу 29/1367\nОтд 16 29/760\n\nПредп культ под оз пш\nПо Пу 146/1217\nОтд 11 146/233\n\nДисков сах св\nПо Пу 64/934\nОтд 17 64/232\n\n2-е диск сах св под пш\nПо Пу 25/775\nОтд 12 25/475\"\\",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"ТСК\nВыравнивание зяби под сою 25 га/ с нарастающим 765 га ( 13%) Остаток 5332 га\nВыравнивание зяби под кукурузу 131га (3%) Остаток 4486 га\nОсадки 1мм\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"Восход\nПосев кукурузы\nДень-86/107га, 10%\nПредпосевная культ\nДень-177/396га, 37%\n2-я подкорм оз пш\nДень-739/1431га65%\nСЗР по оз пш\nДень-136/272га12%\nСЗР по оз ячм\nДень-71/71га22%\nДовсходовое боронование подсолнечника\nДень-184/289га55%\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"Выравн под кук зерно\nПоПу 82/1042\nОтд 12 82/549\nВыравн под кук силос\nПоПу 30/907\nОтд 11 30/437\nПредп культ под сах св\nПоПу 531/1184\nОтд 11 80/174\nОтд 12 260/467\nОтд 16 101/348\nОтд 17 90/195\nСев сах св\nПоПу 357/579\nОтд 11 80/97\nОтд 12 85/130\nОтд 16 81/231\nОтд 17 111/121\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"15.10\nВнесение мин удобрений под оз пшеницу 2025 г ПУ Юг 117/7381\nОтд 17-117/1560\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"ТСК \nВыравнивание зяби под сою 199 га/ с нарастающим 533 га (8%) Остаток 5564 га\nОсадки 2 мм\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"12.10\nВнесение мин удобрений под оз пшеницу 2025 г ПУ Юг 149/7264\nОтд 17-149/1443\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"Вырав зяби под подсол\nПо Пу 199/923\nОтд 11 108/241\nОтд 17 91/133\nВырав зяби под сах/ св\nПо Пу 78/2827\nОтд 17 78/857\nВырав зяби под сою\nПо Пу 121/580\nОтд 11 80/80\nОтд 16 41/381\nВырав зяби под Кук/сил\nПо Пу 43/528\nОтд 11 43/149\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"Пахота зяби под мн тр\nПо Пу 26/488\nОтд 12 26/221\n\nПредп культ под оз пш\nПо Пу 215/1015\nОтд 12 128/317\nОтд 16 123/529\n\n2-е диск сах св под пш\nПо Пу 22/627\nОтд 11 22/217\n\n2-е диск сои под оз пш\nПо Пу 45/1907\nОтд 12 45/299\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"Пахота зяби под мн тр\nПо Пу 13/579\nОтд 12 13/312\n\n2-е дисков сах св\nПо Пу 35/957\nОтд 17 35/290\n\nВыравн зяби под мн тр\nПо Пу 101/438\nОтд 12 101/171\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"Пахота зяби под мн тр\nПо Пу 26/514\nОтд 12 26/247\n\nПахота зяби под сою\nПо Пу 13/1351\nОтд 16 13/731\n\nПредп культ под оз пш\nПо Пу 56/1071\nОтд 16 56/585\n\nДисков сах св\nПо Пу 85/870\nОтд 17 85/168\n\n2-е диск сах св под пш\nПо Пу 123/750\nОтд 12 123/450\n\n2-е диск сои под оз пш\nПо Пу 82/1989\nОтд 11 82/993\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"Диск оз пшеницы \nПо Пу 95/8627\nОтд 17 95/1923\n\n2-е диск под сах св\nПо Пу 151/1065\nОтд 16 151/842\n\n2-е диск под оз ячмень \nПо Пу 136/605\nОтд 11 70/219\nОтд 11 66/285\n\n2-е диск под рапс\nПо ПУ 60/202\nОтд 16 60/89\n\nПахота под мн тр\nПо Пу 25/386\nОтд 17 25/28\n\nПахота под сах св\nОтд 12 24/105\n\nЧизел под оз ячмень\n(дракула)\nПо Пу 64/350\nОтд 12 64/219\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"26.07\nВнесение мин удобрений под сах свёклу 2025 г ПУ Юг- 80/1157\n\nОтд 12-80/314\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"19.11 Мир\nПахота зяби под кукурузу 8 га день, 672 га от начала, 100%\nПахота зяби под сою 70 га день, 1009 га от начала, 89%, 130 га остаток.\nРаботало 3 агрегата.\nВыравнивание зяби под подсолнечник 15 га день, 15 га от начала, 2%, остаток 691га. Работал 1 агрегат\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"28.03.25г.\nСП Коломейцево\n\nпредпосевная культивация  \n  -под подсолнечник\n    день 40га\n    от начала 60га(29%)\n\nСев сахарной свеклы: \nДень 30га\nОт начала 295га(94%)\n\nсев подсолнечника \n  день 25га\n  от начала 25га(12%)\n\nСплошная культивация под сою:\n  день 55га \n  от начала 200га (80%)\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"АО Кропоткинское\n28.03.25\n2 подкормка озимой пшеницы - 622/6975\nПредпосевная культивация под сах.свеклу - 426/1628\nСев сах.свеклы - 285/1229 (57%) 7ед.\nОсталось 912га\nВыравнивание зяби под кукурузу - 161/2804\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"14.11 Мир\nПахота зяби под кукурузу 57 га день, 562 га от начала, 83%, 110 га остаток.\nПахота зяби под сою 60 га день, 799 га от начала, 70%, 340 га остаток.\nРаботало 5 агрегатов.\nВыравнивание зяби под сахарную свёклу 130 га день, 874 га от начала, 92 %, 78 га остаток.\nРаботал 1 агрегат.\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"30.03.25г Мир.\nПредпосевная культивация под подсолнечник 50/97 - 14%\nСев подсолнечника 17/47 - 6%\n2-я подкормка озимой пшеницы 371/5118 - 97%\nНа данный момент осадки в 2х районах до 3мм\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"АО Кропоткинское\n30.03.2024\n2 подкормка озимой пшеницы 504/7758\nСев сах.свеклы 241/1806 87% (7ед)\nОсталось 335га\nВыравнивание зяби под кукурузу 70/2874\nПредпосевная культивация под подсолнечник 70/70\"",
    "Проанализируй сообщение и распредели по группам\n Вот пример сообщения: \"Вырав под сою\nПоПу 24/1481\nОтд 11 24/712\nПредп культ под сах св\nПоПу 369/2656\nОтд 11 156/639\nОтд 12 48/795\nОтд 17 163/751\nСев сах св\nПоПу 355/2287\nОтд 11 80/481\nОтд 12 133/659\nОтд 17 142/678\""
    ]
